#1
#1)
2 + 2
#2)
4 + 5
#3)
6 - 2
#4)
123 + 456
#5)
5*3
#6)
12*12
#7)
5/3
#8)
12/6
#9)
sum(1:5)
#10)
(12 + 34 - 56)*78/90
#11)
5%%3
#12)
12^2
#13)
12^(1/2)
#14)
12^(1/3)
#15)
pi
#16)
sqrt(12)
#17)
exp(3.4567)
#18)
log(exp(3.456))
#19)
log(100, base=10)
#20)
log10(100)
#21)
log(16, base=2)
#22)
log2(16)
#23)
(cos(pi/3) - sqrt(2))/exp(4)

#2
#1)
vector1 <- 1:33
#2)
vector2 <- seq(99, 0, by=-11)
#3)
vector4 <- numeric(100)
#4)
vector5 <- rep(5, 100)
#5)
kuri10 <- rep(1:3, 10)
#6)
kuri11 <- rep(1:10, 1:10)
#7)
kisuu <- seq(1, 100, by=2)

#3
length(seq(3, 50, by=3))
# sum((1:50)%%3 == 0) としても計算できる（論理ベクトルを数値ベクトルとみなして、その和を計算している）

#4
v <- 1:100
sum(v^v)

#5
hamadango <- c(35.0, 38.0, 41.0, 15.0, 47.2, 36.5, 27.0, 38.0, 
64.6, 34.0, 39.0, 41.0, 39.0, 37.3, 51.5, 53.7, 54.0, 17.5, 
32.5, 39.4, 35.0, 39.2, 42.0, 24.8, 27.1, 30.0, 25.3, 23.3, 
36.8, 38.7, 37.6, 38.6, 16.5, 34.5, 54.0, 32.2, 39.2, 36.0, 34.9)
mean(hamadango) #標本平均
var(hamadango) #標本分散
sd(hamadango) #標本標準偏差
median(hamadango) #中央値
max(hamadango) #最大値
min(hamadango) #最小値
hist(hamadango)

#6
days30kg <- c(75, 67, 65, 71, 72)
days90kg <- c(158, 149, 143, 153, 147)
plot(days30kg, days90kg)








